export default {
  nodes: [
    {
      id: "毛利率同比下降",
      label: "毛利率同比下降",
    },
    {
      id: "扣非后归母净利率为0.9pct，同比下降1.2pct",
      label: "扣非后归母净利率为0.9pct，同比下降1.2pct",
    },
    {
      id: "成本优化",
      label: "成本优化",
    },
    {
      id: "运营商网络毛利率49.11%，同比提升2.89pct",
      label: "运营商网络毛利率49.11%，同比提升2.89pct",
    },
    {
      id: "公司持续加大研发投入和市场端投入",
      label: "公司持续加大研发投入和市场端投入",
    },
    {
      id: "公司四大费用率合计32.18%，同比提升2.68pct",
      label: "公司四大费用率合计32.18%，同比提升2.68pct",
    },
    {
      id: "汇率波动",
      label: "汇率波动",
    },
    {
      id: "汇兑收益",
      label: "汇兑收益",
    },
    {
      id: "投资所支付的现金增加",
      label: "投资所支付的现金增加",
    },
    {
      id: "投资活动产生的现金流量净流出增加",
      label: "投资活动产生的现金流量净流出增加",
    },
    {
      id: "提高经营效率",
      label: "提高经营效率",
    },
    {
      id: "扣非后归母净利润增速优于收入增速",
      label: "扣非后归母净利润增速优于收入增速",
    },
    {
      id: "公司持续降本增效",
      label: "公司持续降本增效",
    },
    {
      id: "全球经济增速下行压力",
      label: "全球经济增速下行压力",
    },
    {
      id: "公司整体收入增长平稳",
      label: "公司整体收入增长平稳",
    },
    {
      id: "四大费用率之和上升",
      label: "四大费用率之和上升",
    },
    {
      id: "扣非后归母净利润增速低于收入增速",
      label: "扣非后归母净利润增速低于收入增速",
    },
    {
      id: "运营商网络毛利率下降",
      label: "运营商网络毛利率下降",
    },
    {
      id: "毛利率环比下降",
      label: "毛利率环比下降",
    },
    {
      id: "三大业务的毛利率同步同比提升",
      label: "三大业务的毛利率同步同比提升",
    },
    {
      id: "收入结构变化",
      label: "收入结构变化",
    },
    {
      id: "薪酬福利增加",
      label: "薪酬福利增加",
    },
    {
      id: "管理费用56.3亿元，同比增长5.61%",
      label: "管理费用56.3亿元，同比增长5.61%",
    },
    {
      id: "下游电信资本开支增速放缓",
      label: "下游电信资本开支增速放缓",
    },
    {
      id: "营收平稳微增",
      label: "营收平稳微增",
    },
    {
      id: "盈利能力持续改善",
      label: "盈利能力持续改善",
    },
    {
      id: "经营质量持续向好",
      label: "经营质量持续向好",
    },
    {
      id: "费用率同比提升",
      label: "费用率同比提升",
    },
    {
      id: "全年盈利能力持续提升",
      label: "全年盈利能力持续提升",
    },
    {
      id: "收入增速放缓",
      label: "收入增速放缓",
    },
    {
      id: "公司的经营性现金流量净额再创新高",
      label: "公司的经营性现金流量净额再创新高",
    },
    {
      id: "购买商品、接受劳务支付的现金减少",
      label: "购买商品、接受劳务支付的现金减少",
    },
    {
      id: "无线产品、有线产品的营业收入增长",
      label: "无线产品、有线产品的营业收入增长",
    },
    {
      id: "运营商网络业务实现营业收入",
      label: "运营商网络业务实现营业收入",
    },
    {
      id: "国内集成类项目、数据中心和国际市场营业收入减少",
      label: "国内集成类项目、数据中心和国际市场营业收入减少",
    },
    {
      id: "政企业务实现营业收入135.84亿元，同比减少7.14%",
      label: "政企业务实现营业收入135.84亿元，同比减少7.14%",
    },
    {
      id: "Wi-Fi产品连续4年保持发货量第一",
      label: "Wi-Fi产品连续4年保持发货量第一",
    },
    {
      id: "家庭终端收入持续增长",
      label: "家庭终端收入持续增长",
    },
    {
      id: "市场需求下降",
      label: "市场需求下降",
    },
    {
      id: "家庭终端和手机产品收入增长挑战大",
      label: "家庭终端和手机产品收入增长挑战大",
    },
    {
      id: "市场推广投入增加",
      label: "市场推广投入增加",
    },
    {
      id: "销售费用",
      label: "销售费用",
    },
    {
      id: "政企业务营业收入135.83亿元，同比下降7.14%",
      label: "政企业务营业收入135.83亿元，同比下降7.14%",
    },
    {
      id: "多年积累的通信领域软硬件研发能力",
      label: "多年积累的通信领域软硬件研发能力",
    },
    {
      id: "公司已构建基于服务器及存储、交换机、数据中心等产品的全面矩阵",
      label: "公司已构建基于服务器及存储、交换机、数据中心等产品的全面矩阵",
    },
    {
      id: "国际家庭终端、国际手机产品营业收入减少",
      label: "国际家庭终端、国际手机产品营业收入减少",
    },
    {
      id: "消费者业务实现营业收入279.09亿元，同比减少1.33%",
      label: "消费者业务实现营业收入279.09亿元，同比减少1.33%",
    },
    {
      id: "推出红魔9Pro、裸眼3D平板nubia Pad 3D、远航、畅行系列等新产品",
      label: "推出红魔9Pro、裸眼3D平板nubia Pad 3D、远航、畅行系列等新产品",
    },
    {
      id: "手机产品收入逆势增长",
      label: "手机产品收入逆势增长",
    },
    {
      id: "竞争加剧",
      label: "竞争加剧",
    },
    {
      id: "国际家庭信息终端、手机产品毛利率提升",
      label: "国际家庭信息终端、手机产品毛利率提升",
    },
    {
      id: "三大业务毛利率均有提升",
      label: "三大业务毛利率均有提升",
    },
    {
      id: "产品结构变动",
      label: "产品结构变动",
    },
    {
      id: "持续优化成本",
      label: "持续优化成本",
    },
    {
      id: "公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
      label: "公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
    },
    {
      id: "公司政企业务营业收入 135.84亿元，同比减少 7.14%",
      label: "公司政企业务营业收入 135.84亿元，同比减少 7.14%",
    },
    {
      id: "公司消费者业务营业收入279.09亿元，同比减少 1.33%",
      label: "公司消费者业务营业收入279.09亿元，同比减少 1.33%",
    },
    {
      id: "收入结构变动",
      label: "收入结构变动",
    },
    {
      id: "盈利能力提升",
      label: "盈利能力提升",
    },
    {
      id: "国内集成类项目、数据中心和国际市场营收减少",
      label: "国内集成类项目、数据中心和国际市场营收减少",
    },
    {
      id: "公司政企业务营收同比减少",
      label: "公司政企业务营收同比减少",
    },
    {
      id: "公司稳健经营",
      label: "公司稳健经营",
    },
    {
      id: "公司聚焦经营质量",
      label: "公司聚焦经营质量",
    },
    {
      id: "无线产品、有线产品营业收入增长",
      label: "无线产品、有线产品营业收入增长",
    },
    {
      id: "高毛利的运营商业务占比提高",
      label: "高毛利的运营商业务占比提高",
    },
    {
      id: "盈利能力快速提升",
      label: "盈利能力快速提升",
    },
    {
      id: "无线产品、有线产品营收增长",
      label: "无线产品、有线产品营收增长",
    },
    {
      id: "公司运营商网络业务营收同比增长",
      label: "公司运营商网络业务营收同比增长",
    },
    {
      id: "国际家庭终端、国际手机产品营收减少",
      label: "国际家庭终端、国际手机产品营收减少",
    },
    {
      id: "公司消费者业务营收同比减少",
      label: "公司消费者业务营收同比减少",
    },
    {
      id: "强化服务器、数据中心交换机、数据中心、分布式数据库等主力产品",
      label: "强化服务器、数据中心交换机、数据中心、分布式数据库等主力产品",
    },
    {
      id: "第二曲线业务将快速成长",
      label: "第二曲线业务将快速成长",
    },
    {
      id: "高研发",
      label: "高研发",
    },
    {
      id: "高壁垒",
      label: "高壁垒",
    },
    {
      id: "支撑起未来几年公司的营收表现",
      label: "支撑起未来几年公司的营收表现",
    },
    {
      id: "提高盈利能力",
      label: "提高盈利能力",
    },
    {
      id: "公司2023年全年毛利率41.53%、同比提升4.34个百分点",
      label: "公司2023年全年毛利率41.53%、同比提升4.34个百分点",
    },
    {
      id: "各项业务毛利率快速爬升",
      label: "各项业务毛利率快速爬升",
    },
    {
      id: "整体盈利能力表现优异",
      label: "整体盈利能力表现优异",
    },
    {
      id: "增加高端产品销售",
      label: "增加高端产品销售",
    },
    {
      id: "各项业务通过优化成本",
      label: "各项业务通过优化成本",
    },
    {
      id: "实现毛利率49.11%，同比提升2.89pct",
      label: "实现毛利率49.11%，同比提升2.89pct",
    },
    {
      id: "营业收入827.59亿元，同比增长3.40%",
      label: "营业收入827.59亿元，同比增长3.40%",
    },
    {
      id: "实现营业收入135.84亿元，同比下滑7.14%",
      label: "实现营业收入135.84亿元，同比下滑7.14%",
    },
    {
      id: "实现毛利率34.94%，同比上升9.59pct",
      label: "实现毛利率34.94%，同比上升9.59pct",
    },
    {
      id: "实现毛利率22.26%，同比上升4.50pct",
      label: "实现毛利率22.26%，同比上升4.50pct",
    },
    {
      id: "5G无线、核心网、固网产品收入增长",
      label: "5G无线、核心网、固网产品收入增长",
    },
    {
      id: "政务业务营收",
      label: "政务业务营收",
    },
    {
      id: "5G份额保持领先",
      label: "5G份额保持领先",
    },
    {
      id: "连接+算力打开长期成长空间",
      label: "连接+算力打开长期成长空间",
    },
    {
      id: "公司运营商网络业务营收",
      label: "公司运营商网络业务营收",
    },
    {
      id: "实现营业收入279.09亿元，同比略微减少1.33%",
      label: "实现营业收入279.09亿元，同比略微减少1.33%",
    },
    {
      id: "中兴通讯精准务实，稳健经营",
      label: "中兴通讯精准务实，稳健经营",
    },
    {
      id: "整体业绩符合预期",
      label: "整体业绩符合预期",
    },
    {
      id: "季节性利润波动",
      label: "季节性利润波动",
    },
    {
      id: "公司业绩短期承压",
      label: "公司业绩短期承压",
    },
    {
      id: "公司资产减值",
      label: "公司资产减值",
    },
    {
      id: "运营商网络、政企和消费者业务三大业务的毛利率均有提升",
      label: "运营商网络、政企和消费者业务三大业务的毛利率均有提升",
    },
    {
      id: "毛利率的提升",
      label: "毛利率的提升",
    },
    {
      id: "毛利率为34.94%，同比提升9.59pct",
      label: "毛利率为34.94%，同比提升9.59pct",
    },
    {
      id: "全年营业收入135.84亿元，同比减少7.14%",
      label: "全年营业收入135.84亿元，同比减少7.14%",
    },
    {
      id: "全年营业收入 279.09亿元，同比减少 1.33%",
      label: "全年营业收入 279.09亿元，同比减少 1.33%",
    },
    {
      id: "利润持续快速增长",
      label: "利润持续快速增长",
    },
    {
      id: "汇率变动",
      label: "汇率变动",
    },
    {
      id: "现金净增加额",
      label: "现金净增加额",
    },
    {
      id: "国际市场家庭终端和手机产品市场需求下降",
      label: "国际市场家庭终端和手机产品市场需求下降",
    },
    {
      id: "新兴产品持续导入市场",
      label: "新兴产品持续导入市场",
    },
    {
      id: "市场份额及盈利能力有望进一步提升",
      label: "市场份额及盈利能力有望进一步提升",
    },
    {
      id: "公司工业、冶金钢铁、矿山、汽车电子业务均已实现与多家行业头部企业的合作",
      label:
        "公司工业、冶金钢铁、矿山、汽车电子业务均已实现与多家行业头部企业的合作",
    },
    {
      id: "助力行业数智化转型",
      label: "助力行业数智化转型",
    },
    {
      id: "公司运营商业务在行业竞争格局向好",
      label: "公司运营商业务在行业竞争格局向好",
    },
    {
      id: "政企和消费者业务成本减少",
      label: "政企和消费者业务成本减少",
    },
    {
      id: "政企业务毛利率为34.94%，同比增长9.59pct",
      label: "政企业务毛利率为34.94%，同比增长9.59pct",
    },
    {
      id: "消费者业务毛利率为22.26%，同比增长4.50pct",
      label: "消费者业务毛利率为22.26%，同比增长4.50pct",
    },
    {
      id: "运营商网络毛利率为49.11%，同比增长2.89pct",
      label: "运营商网络毛利率为49.11%，同比增长2.89pct",
    },
    {
      id: "收入短期承压",
      label: "收入短期承压",
    },
    {
      id: "净利润维持增长态势",
      label: "净利润维持增长态势",
    },
    {
      id: "公司销售毛利率为41.53%，同比上升4.34个百分点",
      label: "公司销售毛利率为41.53%，同比上升4.34个百分点",
    },
    {
      id: "产生汇兑收益",
      label: "产生汇兑收益",
    },
    {
      id: "本期购买商品、接受劳务支付的现金减少",
      label: "本期购买商品、接受劳务支付的现金减少",
    },
    {
      id: "经营活动产生的现金流净额为174.06亿元，同比上升129.7%",
      label: "经营活动产生的现金流净额为174.06亿元，同比上升129.7%",
    },
  ],
  edges: [
    {
      source: "毛利率同比下降",
      target: "扣非后归母净利率为0.9pct，同比下降1.2pct",
      label: "下跌",
      description:
        "毛利率同比下降产生的下跌影响，导致了扣非后归母净利率为0.9pct，同比下降1.2pct",
    },
    {
      source: "成本优化",
      target: "运营商网络毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "成本优化产生的上涨影响，导致了运营商网络毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "公司持续加大研发投入和市场端投入",
      target: "公司四大费用率合计32.18%，同比提升2.68pct",
      label: "上涨",
      description:
        "公司持续加大研发投入和市场端投入产生的上涨影响，导致了公司四大费用率合计32.18%，同比提升2.68pct",
    },
    {
      source: "汇率波动",
      target: "汇兑收益",
      label: "其他状态类",
      description: "汇率波动产生的其他状态类影响，导致了汇兑收益",
    },
    {
      source: "投资所支付的现金增加",
      target: "投资活动产生的现金流量净流出增加",
      label: "上涨",
      description:
        "投资所支付的现金增加产生的上涨影响，导致了投资活动产生的现金流量净流出增加",
    },
    {
      source: "提高经营效率",
      target: "扣非后归母净利润增速优于收入增速",
      label: "其他状态类",
      description:
        "提高经营效率产生的其他状态类影响，导致了扣非后归母净利润增速优于收入增速",
    },
    {
      source: "公司持续降本增效",
      target: "扣非后归母净利润增速优于收入增速",
      label: "其他状态类",
      description:
        "公司持续降本增效产生的其他状态类影响，导致了扣非后归母净利润增速优于收入增速",
    },
    {
      source: "全球经济增速下行压力",
      target: "公司整体收入增长平稳",
      label: "上涨",
      description:
        "全球经济增速下行压力产生的上涨影响，导致了公司整体收入增长平稳",
    },
    {
      source: "公司持续降本增效",
      target: "扣非后归母净利润增速优于收入增速",
      label: "其他状态类",
      description:
        "公司持续降本增效产生的其他状态类影响，导致了扣非后归母净利润增速优于收入增速",
    },
    {
      source: "全球经济增速下行压力",
      target: "公司整体收入增长平稳",
      label: "上涨",
      description:
        "全球经济增速下行压力产生的上涨影响，导致了公司整体收入增长平稳",
    },
    {
      source: "四大费用率之和上升",
      target: "扣非后归母净利润增速低于收入增速",
      label: "其他状态类",
      description:
        "四大费用率之和上升产生的其他状态类影响，导致了扣非后归母净利润增速低于收入增速",
    },
    {
      source: "运营商网络毛利率下降",
      target: "毛利率环比下降",
      label: "下跌",
      description: "运营商网络毛利率下降产生的下跌影响，导致了毛利率环比下降",
    },
    {
      source: "毛利率同比下降",
      target: "扣非后归母净利率为0.9pct，同比下降1.2pct",
      label: "下跌",
      description:
        "毛利率同比下降产生的下跌影响，导致了扣非后归母净利率为0.9pct，同比下降1.2pct",
    },
    {
      source: "三大业务的毛利率同步同比提升",
      target: "运营商网络毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "三大业务的毛利率同步同比提升产生的上涨影响，导致了运营商网络毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "收入结构变化",
      target: "运营商网络毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "收入结构变化产生的上涨影响，导致了运营商网络毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "公司持续加大研发投入和市场端投入",
      target: "公司四大费用率合计32.18%，同比提升2.68pct",
      label: "上涨",
      description:
        "公司持续加大研发投入和市场端投入产生的上涨影响，导致了公司四大费用率合计32.18%，同比提升2.68pct",
    },
    {
      source: "薪酬福利增加",
      target: "管理费用56.3亿元，同比增长5.61%",
      label: "上涨",
      description:
        "薪酬福利增加产生的上涨影响，导致了管理费用56.3亿元，同比增长5.61%",
    },
    {
      source: "公司持续降本增效",
      target: "提高经营效率",
      label: "上涨",
      description: "公司持续降本增效产生的上涨影响，导致了提高经营效率",
    },
    {
      source: "下游电信资本开支增速放缓",
      target: "公司整体收入增长平稳",
      label: "上涨",
      description:
        "下游电信资本开支增速放缓产生的上涨影响，导致了公司整体收入增长平稳",
    },
    {
      source: "营收平稳微增",
      target: "盈利能力持续改善",
      label: "上涨",
      description: "营收平稳微增产生的上涨影响，导致了盈利能力持续改善",
    },
    {
      source: "提高经营效率",
      target: "扣非后归母净利润增速优于收入增速",
      label: "其他状态类",
      description:
        "提高经营效率产生的其他状态类影响，导致了扣非后归母净利润增速优于收入增速",
    },
    {
      source: "扣非后归母净利润增速优于收入增速",
      target: "经营质量持续向好",
      label: "上涨",
      description:
        "扣非后归母净利润增速优于收入增速产生的上涨影响，导致了经营质量持续向好",
    },
    {
      source: "下游电信资本开支增速放缓",
      target: "公司整体收入增长平稳",
      label: "上涨",
      description:
        "下游电信资本开支增速放缓产生的上涨影响，导致了公司整体收入增长平稳",
    },
    {
      source: "毛利率同比下降",
      target: "扣非后归母净利润增速低于收入增速",
      label: "其他状态类",
      description:
        "毛利率同比下降产生的其他状态类影响，导致了扣非后归母净利润增速低于收入增速",
    },
    {
      source: "费用率同比提升",
      target: "扣非后归母净利率为0.9pct，同比下降1.2pct",
      label: "下跌",
      description:
        "费用率同比提升产生的下跌影响，导致了扣非后归母净利率为0.9pct，同比下降1.2pct",
    },
    {
      source: "三大业务的毛利率同步同比提升",
      target: "全年盈利能力持续提升",
      label: "上涨",
      description:
        "三大业务的毛利率同步同比提升产生的上涨影响，导致了全年盈利能力持续提升",
    },
    {
      source: "成本优化",
      target: "运营商网络毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "成本优化产生的上涨影响，导致了运营商网络毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "收入增速放缓",
      target: "公司持续加大研发投入和市场端投入",
      label: "上涨",
      description:
        "收入增速放缓产生的上涨影响，导致了公司持续加大研发投入和市场端投入",
    },
    {
      source: "汇率波动",
      target: "汇兑收益",
      label: "其他状态类",
      description: "汇率波动产生的其他状态类影响，导致了汇兑收益",
    },
    {
      source: "投资所支付的现金增加",
      target: "投资活动产生的现金流量净流出增加",
      label: "上涨",
      description:
        "投资所支付的现金增加产生的上涨影响，导致了投资活动产生的现金流量净流出增加",
    },
    {
      source: "投资所支付的现金增加",
      target: "公司的经营性现金流量净额再创新高",
      label: "高位",
      description:
        "投资所支付的现金增加产生的高位影响，导致了公司的经营性现金流量净额再创新高",
    },
    {
      source: "购买商品、接受劳务支付的现金减少",
      target: "公司的经营性现金流量净额再创新高",
      label: "高位",
      description:
        "购买商品、接受劳务支付的现金减少产生的高位影响，导致了公司的经营性现金流量净额再创新高",
    },
    {
      source: "营收平稳微增",
      target: "盈利能力持续改善",
      label: "上涨",
      description: "营收平稳微增产生的上涨影响，导致了盈利能力持续改善",
    },
    {
      source: "公司持续降本增效",
      target: "提高经营效率",
      label: "上涨",
      description: "公司持续降本增效产生的上涨影响，导致了提高经营效率",
    },
    {
      source: "下游电信资本开支增速放缓",
      target: "公司整体收入增长平稳",
      label: "上涨",
      description:
        "下游电信资本开支增速放缓产生的上涨影响，导致了公司整体收入增长平稳",
    },
    {
      source: "四大费用率之和上升",
      target: "扣非后归母净利润增速低于收入增速",
      label: "其他状态类",
      description:
        "四大费用率之和上升产生的其他状态类影响，导致了扣非后归母净利润增速低于收入增速",
    },
    {
      source: "公司持续降本增效",
      target: "扣非后归母净利润增速优于收入增速",
      label: "其他状态类",
      description:
        "公司持续降本增效产生的其他状态类影响，导致了扣非后归母净利润增速优于收入增速",
    },
    {
      source: "提高经营效率",
      target: "扣非后归母净利润增速优于收入增速",
      label: "其他状态类",
      description:
        "提高经营效率产生的其他状态类影响，导致了扣非后归母净利润增速优于收入增速",
    },
    {
      source: "全球经济增速下行压力",
      target: "公司整体收入增长平稳",
      label: "上涨",
      description:
        "全球经济增速下行压力产生的上涨影响，导致了公司整体收入增长平稳",
    },
    {
      source: "提高经营效率",
      target: "扣非后归母净利润增速优于收入增速",
      label: "其他状态类",
      description:
        "提高经营效率产生的其他状态类影响，导致了扣非后归母净利润增速优于收入增速",
    },
    {
      source: "全球经济增速下行压力",
      target: "公司整体收入增长平稳",
      label: "上涨",
      description:
        "全球经济增速下行压力产生的上涨影响，导致了公司整体收入增长平稳",
    },
    {
      source: "下游电信资本开支增速放缓",
      target: "公司整体收入增长平稳",
      label: "上涨",
      description:
        "下游电信资本开支增速放缓产生的上涨影响，导致了公司整体收入增长平稳",
    },
    {
      source: "扣非后归母净利润增速优于收入增速",
      target: "经营质量持续向好",
      label: "上涨",
      description:
        "扣非后归母净利润增速优于收入增速产生的上涨影响，导致了经营质量持续向好",
    },
    {
      source: "公司持续降本增效",
      target: "扣非后归母净利润增速优于收入增速",
      label: "其他状态类",
      description:
        "公司持续降本增效产生的其他状态类影响，导致了扣非后归母净利润增速优于收入增速",
    },
    {
      source: "运营商网络毛利率下降",
      target: "毛利率环比下降",
      label: "下跌",
      description: "运营商网络毛利率下降产生的下跌影响，导致了毛利率环比下降",
    },
    {
      source: "三大业务的毛利率同步同比提升",
      target: "运营商网络毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "三大业务的毛利率同步同比提升产生的上涨影响，导致了运营商网络毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "收入结构变化",
      target: "运营商网络毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "收入结构变化产生的上涨影响，导致了运营商网络毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "薪酬福利增加",
      target: "管理费用56.3亿元，同比增长5.61%",
      label: "上涨",
      description:
        "薪酬福利增加产生的上涨影响，导致了管理费用56.3亿元，同比增长5.61%",
    },
    {
      source: "购买商品、接受劳务支付的现金减少",
      target: "公司的经营性现金流量净额再创新高",
      label: "高位",
      description:
        "购买商品、接受劳务支付的现金减少产生的高位影响，导致了公司的经营性现金流量净额再创新高",
    },
    {
      source: "毛利率同比下降",
      target: "扣非后归母净利润增速低于收入增速",
      label: "其他状态类",
      description:
        "毛利率同比下降产生的其他状态类影响，导致了扣非后归母净利润增速低于收入增速",
    },
    {
      source: "费用率同比提升",
      target: "扣非后归母净利率为0.9pct，同比下降1.2pct",
      label: "下跌",
      description:
        "费用率同比提升产生的下跌影响，导致了扣非后归母净利率为0.9pct，同比下降1.2pct",
    },
    {
      source: "三大业务的毛利率同步同比提升",
      target: "全年盈利能力持续提升",
      label: "上涨",
      description:
        "三大业务的毛利率同步同比提升产生的上涨影响，导致了全年盈利能力持续提升",
    },
    {
      source: "收入增速放缓",
      target: "公司持续加大研发投入和市场端投入",
      label: "上涨",
      description:
        "收入增速放缓产生的上涨影响，导致了公司持续加大研发投入和市场端投入",
    },
    {
      source: "投资所支付的现金增加",
      target: "公司的经营性现金流量净额再创新高",
      label: "高位",
      description:
        "投资所支付的现金增加产生的高位影响，导致了公司的经营性现金流量净额再创新高",
    },
    {
      source: "无线产品、有线产品的营业收入增长",
      target: "运营商网络业务实现营业收入",
      label: "上涨",
      description:
        "无线产品、有线产品的营业收入增长产生的上涨影响，导致了运营商网络业务实现营业收入",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "政企业务实现营业收入135.84亿元，同比减少7.14%",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的下跌影响，导致了政企业务实现营业收入135.84亿元，同比减少7.14%",
    },
    {
      source: "Wi-Fi产品连续4年保持发货量第一",
      target: "家庭终端收入持续增长",
      label: "上涨",
      description:
        "Wi-Fi产品连续4年保持发货量第一产生的上涨影响，导致了家庭终端收入持续增长",
    },
    {
      source: "市场需求下降",
      target: "家庭终端和手机产品收入增长挑战大",
      label: "下跌",
      description:
        "市场需求下降产生的下跌影响，导致了家庭终端和手机产品收入增长挑战大",
    },
    {
      source: "市场推广投入增加",
      target: "销售费用",
      label: "无状态",
      description: "市场推广投入增加产生的无状态影响，导致了销售费用",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "运营商网络业务实现营业收入",
      label: "上涨",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的上涨影响，导致了运营商网络业务实现营业收入",
    },
    {
      source: "无线产品、有线产品的营业收入增长",
      target: "政企业务营业收入135.83亿元，同比下降7.14%",
      label: "下跌",
      description:
        "无线产品、有线产品的营业收入增长产生的下跌影响，导致了政企业务营业收入135.83亿元，同比下降7.14%",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "政企业务营业收入135.83亿元，同比下降7.14%",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的下跌影响，导致了政企业务营业收入135.83亿元，同比下降7.14%",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "政企业务营业收入135.83亿元，同比下降7.14%",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的下跌影响，导致了政企业务营业收入135.83亿元，同比下降7.14%",
    },
    {
      source: "多年积累的通信领域软硬件研发能力",
      target: "公司已构建基于服务器及存储、交换机、数据中心等产品的全面矩阵",
      label: "其他状态类",
      description:
        "多年积累的通信领域软硬件研发能力产生的其他状态类影响，导致了公司已构建基于服务器及存储、交换机、数据中心等产品的全面矩阵",
    },
    {
      source: "国际家庭终端、国际手机产品营业收入减少",
      target: "消费者业务实现营业收入279.09亿元，同比减少1.33%",
      label: "下跌",
      description:
        "国际家庭终端、国际手机产品营业收入减少产生的下跌影响，导致了消费者业务实现营业收入279.09亿元，同比减少1.33%",
    },
    {
      source: "推出红魔9Pro、裸眼3D平板nubia Pad 3D、远航、畅行系列等新产品",
      target: "手机产品收入逆势增长",
      label: "上涨",
      description:
        "推出红魔9Pro、裸眼3D平板nubia Pad 3D、远航、畅行系列等新产品产生的上涨影响，导致了手机产品收入逆势增长",
    },
    {
      source: "竞争加剧",
      target: "家庭终端和手机产品收入增长挑战大",
      label: "下跌",
      description:
        "竞争加剧产生的下跌影响，导致了家庭终端和手机产品收入增长挑战大",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "三大业务毛利率均有提升",
      label: "上涨",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的上涨影响，导致了三大业务毛利率均有提升",
    },
    {
      source: "成本优化",
      target: "三大业务毛利率均有提升",
      label: "上涨",
      description: "成本优化产生的上涨影响，导致了三大业务毛利率均有提升",
    },
    {
      source: "无线产品、有线产品的营业收入增长",
      target: "政企业务营业收入135.83亿元，同比下降7.14%",
      label: "下跌",
      description:
        "无线产品、有线产品的营业收入增长产生的下跌影响，导致了政企业务营业收入135.83亿元，同比下降7.14%",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "运营商网络业务实现营业收入",
      label: "上涨",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的上涨影响，导致了运营商网络业务实现营业收入",
    },
    {
      source: "产品结构变动",
      target: "三大业务毛利率均有提升",
      label: "上涨",
      description: "产品结构变动产生的上涨影响，导致了三大业务毛利率均有提升",
    },
    {
      source: "持续优化成本",
      target: "公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "公司政企业务营业收入 135.84亿元，同比减少 7.14%",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的下跌影响，导致了公司政企业务营业收入 135.84亿元，同比减少 7.14%",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "公司消费者业务营业收入279.09亿元，同比减少 1.33%",
      label: "下跌",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的下跌影响，导致了公司消费者业务营业收入279.09亿元，同比减少 1.33%",
    },
    {
      source: "收入结构变动",
      target: "公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
      label: "上涨",
      description:
        "收入结构变动产生的上涨影响，导致了公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
    },
    {
      source: "国际家庭终端、国际手机产品营业收入减少",
      target: "公司消费者业务营业收入279.09亿元，同比减少 1.33%",
      label: "下跌",
      description:
        "国际家庭终端、国际手机产品营业收入减少产生的下跌影响，导致了公司消费者业务营业收入279.09亿元，同比减少 1.33%",
    },
    {
      source: "持续优化成本",
      target: "公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
    },
    {
      source: "成本优化",
      target: "盈利能力提升",
      label: "上涨",
      description: "成本优化产生的上涨影响，导致了盈利能力提升",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营收减少",
      target: "公司政企业务营收同比减少",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营收减少产生的下跌影响，导致了公司政企业务营收同比减少",
    },
    {
      source: "公司稳健经营",
      target: "盈利能力提升",
      label: "上涨",
      description: "公司稳健经营产生的上涨影响，导致了盈利能力提升",
    },
    {
      source: "公司聚焦经营质量",
      target: "盈利能力提升",
      label: "上涨",
      description: "公司聚焦经营质量产生的上涨影响，导致了盈利能力提升",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "公司消费者业务营业收入279.09亿元，同比减少 1.33%",
      label: "下跌",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的下跌影响，导致了公司消费者业务营业收入279.09亿元，同比减少 1.33%",
    },
    {
      source: "收入结构变动",
      target: "公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
      label: "上涨",
      description:
        "收入结构变动产生的上涨影响，导致了公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
    },
    {
      source: "无线产品、有线产品营业收入增长",
      target: "公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
      label: "上涨",
      description:
        "无线产品、有线产品营业收入增长产生的上涨影响，导致了公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
    },
    {
      source: "国际家庭终端、国际手机产品营业收入减少",
      target: "公司消费者业务营业收入279.09亿元，同比减少 1.33%",
      label: "下跌",
      description:
        "国际家庭终端、国际手机产品营业收入减少产生的下跌影响，导致了公司消费者业务营业收入279.09亿元，同比减少 1.33%",
    },
    {
      source: "无线产品、有线产品营业收入增长",
      target: "公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
      label: "上涨",
      description:
        "无线产品、有线产品营业收入增长产生的上涨影响，导致了公司运营商网络营业收入 827.59亿元，同比增长 3.40%",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "公司政企业务营业收入 135.84亿元，同比减少 7.14%",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的下跌影响，导致了公司政企业务营业收入 135.84亿元，同比减少 7.14%",
    },
    {
      source: "高毛利的运营商业务占比提高",
      target: "盈利能力快速提升",
      label: "上涨",
      description:
        "高毛利的运营商业务占比提高产生的上涨影响，导致了盈利能力快速提升",
    },
    {
      source: "无线产品、有线产品营收增长",
      target: "公司运营商网络业务营收同比增长",
      label: "上涨",
      description:
        "无线产品、有线产品营收增长产生的上涨影响，导致了公司运营商网络业务营收同比增长",
    },
    {
      source: "国际家庭终端、国际手机产品营收减少",
      target: "公司消费者业务营收同比减少",
      label: "下跌",
      description:
        "国际家庭终端、国际手机产品营收减少产生的下跌影响，导致了公司消费者业务营收同比减少",
    },
    {
      source: "强化服务器、数据中心交换机、数据中心、分布式数据库等主力产品",
      target: "第二曲线业务将快速成长",
      label: "上涨",
      description:
        "强化服务器、数据中心交换机、数据中心、分布式数据库等主力产品产生的上涨影响，导致了第二曲线业务将快速成长",
    },
    {
      source: "高研发",
      target: "高壁垒",
      label: "高位",
      description: "高研发产生的高位影响，导致了高壁垒",
    },
    {
      source: "支撑起未来几年公司的营收表现",
      target: "提高盈利能力",
      label: "上涨",
      description:
        "支撑起未来几年公司的营收表现产生的上涨影响，导致了提高盈利能力",
    },
    {
      source: "无线产品、有线产品营收增长",
      target: "公司运营商网络业务营收同比增长",
      label: "上涨",
      description:
        "无线产品、有线产品营收增长产生的上涨影响，导致了公司运营商网络业务营收同比增长",
    },
    {
      source: "国际家庭终端、国际手机产品营收减少",
      target: "公司消费者业务营收同比减少",
      label: "下跌",
      description:
        "国际家庭终端、国际手机产品营收减少产生的下跌影响，导致了公司消费者业务营收同比减少",
    },
    {
      source: "强化服务器、数据中心交换机、数据中心、分布式数据库等主力产品",
      target: "第二曲线业务将快速成长",
      label: "上涨",
      description:
        "强化服务器、数据中心交换机、数据中心、分布式数据库等主力产品产生的上涨影响，导致了第二曲线业务将快速成长",
    },
    {
      source: "高研发",
      target: "高壁垒",
      label: "高位",
      description: "高研发产生的高位影响，导致了高壁垒",
    },
    {
      source: "多年积累的通信领域软硬件研发能力",
      target: "公司已构建基于服务器及存储、交换机、数据中心等产品的全面矩阵",
      label: "其他状态类",
      description:
        "多年积累的通信领域软硬件研发能力产生的其他状态类影响，导致了公司已构建基于服务器及存储、交换机、数据中心等产品的全面矩阵",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "政企业务实现营业收入135.84亿元，同比减少7.14%",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的下跌影响，导致了政企业务实现营业收入135.84亿元，同比减少7.14%",
    },
    {
      source: "国际家庭终端、国际手机产品营业收入减少",
      target: "消费者业务实现营业收入279.09亿元，同比减少1.33%",
      label: "下跌",
      description:
        "国际家庭终端、国际手机产品营业收入减少产生的下跌影响，导致了消费者业务实现营业收入279.09亿元，同比减少1.33%",
    },
    {
      source: "推出红魔9Pro、裸眼3D平板nubia Pad 3D、远航、畅行系列等新产品",
      target: "手机产品收入逆势增长",
      label: "上涨",
      description:
        "推出红魔9Pro、裸眼3D平板nubia Pad 3D、远航、畅行系列等新产品产生的上涨影响，导致了手机产品收入逆势增长",
    },
    {
      source: "Wi-Fi产品连续4年保持发货量第一",
      target: "家庭终端收入持续增长",
      label: "上涨",
      description:
        "Wi-Fi产品连续4年保持发货量第一产生的上涨影响，导致了家庭终端收入持续增长",
    },
    {
      source: "竞争加剧",
      target: "家庭终端和手机产品收入增长挑战大",
      label: "下跌",
      description:
        "竞争加剧产生的下跌影响，导致了家庭终端和手机产品收入增长挑战大",
    },
    {
      source: "市场需求下降",
      target: "家庭终端和手机产品收入增长挑战大",
      label: "下跌",
      description:
        "市场需求下降产生的下跌影响，导致了家庭终端和手机产品收入增长挑战大",
    },
    {
      source: "市场推广投入增加",
      target: "销售费用",
      label: "无状态",
      description: "市场推广投入增加产生的无状态影响，导致了销售费用",
    },
    {
      source: "公司稳健经营",
      target: "盈利能力提升",
      label: "上涨",
      description: "公司稳健经营产生的上涨影响，导致了盈利能力提升",
    },
    {
      source: "成本优化",
      target: "盈利能力提升",
      label: "上涨",
      description: "成本优化产生的上涨影响，导致了盈利能力提升",
    },
    {
      source: "公司聚焦经营质量",
      target: "盈利能力提升",
      label: "上涨",
      description: "公司聚焦经营质量产生的上涨影响，导致了盈利能力提升",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营收减少",
      target: "公司政企业务营收同比减少",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营收减少产生的下跌影响，导致了公司政企业务营收同比减少",
    },
    {
      source: "盈利能力快速提升",
      target: "公司2023年全年毛利率41.53%、同比提升4.34个百分点",
      label: "上涨",
      description:
        "盈利能力快速提升产生的上涨影响，导致了公司2023年全年毛利率41.53%、同比提升4.34个百分点",
    },
    {
      source: "无线产品、有线产品的营业收入增长",
      target: "运营商网络业务实现营业收入",
      label: "上涨",
      description:
        "无线产品、有线产品的营业收入增长产生的上涨影响，导致了运营商网络业务实现营业收入",
    },
    {
      source: "成本优化",
      target: "三大业务毛利率均有提升",
      label: "上涨",
      description: "成本优化产生的上涨影响，导致了三大业务毛利率均有提升",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "三大业务毛利率均有提升",
      label: "上涨",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的上涨影响，导致了三大业务毛利率均有提升",
    },
    {
      source: "产品结构变动",
      target: "三大业务毛利率均有提升",
      label: "上涨",
      description: "产品结构变动产生的上涨影响，导致了三大业务毛利率均有提升",
    },
    {
      source: "各项业务毛利率快速爬升",
      target: "整体盈利能力表现优异",
      label: "高位",
      description:
        "各项业务毛利率快速爬升产生的高位影响，导致了整体盈利能力表现优异",
    },
    {
      source: "盈利能力快速提升",
      target: "公司2023年全年毛利率41.53%、同比提升4.34个百分点",
      label: "上涨",
      description:
        "盈利能力快速提升产生的上涨影响，导致了公司2023年全年毛利率41.53%、同比提升4.34个百分点",
    },
    {
      source: "高毛利的运营商业务占比提高",
      target: "盈利能力快速提升",
      label: "上涨",
      description:
        "高毛利的运营商业务占比提高产生的上涨影响，导致了盈利能力快速提升",
    },
    {
      source: "增加高端产品销售",
      target: "盈利能力快速提升",
      label: "上涨",
      description: "增加高端产品销售产生的上涨影响，导致了盈利能力快速提升",
    },
    {
      source: "各项业务通过优化成本",
      target: "盈利能力快速提升",
      label: "上涨",
      description: "各项业务通过优化成本产生的上涨影响，导致了盈利能力快速提升",
    },
    {
      source: "支撑起未来几年公司的营收表现",
      target: "提高盈利能力",
      label: "上涨",
      description:
        "支撑起未来几年公司的营收表现产生的上涨影响，导致了提高盈利能力",
    },
    {
      source: "各项业务毛利率快速爬升",
      target: "整体盈利能力表现优异",
      label: "高位",
      description:
        "各项业务毛利率快速爬升产生的高位影响，导致了整体盈利能力表现优异",
    },
    {
      source: "增加高端产品销售",
      target: "盈利能力快速提升",
      label: "上涨",
      description: "增加高端产品销售产生的上涨影响，导致了盈利能力快速提升",
    },
    {
      source: "各项业务通过优化成本",
      target: "盈利能力快速提升",
      label: "上涨",
      description: "各项业务通过优化成本产生的上涨影响，导致了盈利能力快速提升",
    },
    {
      source: "收入结构变动",
      target: "实现毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "收入结构变动产生的上涨影响，导致了实现毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "无线产品、有线产品营业收入增长",
      target: "营业收入827.59亿元，同比增长3.40%",
      label: "上涨",
      description:
        "无线产品、有线产品营业收入增长产生的上涨影响，导致了营业收入827.59亿元，同比增长3.40%",
    },
    {
      source: "无线产品、有线产品营业收入增长",
      target: "实现毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "无线产品、有线产品营业收入增长产生的上涨影响，导致了实现毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "持续优化成本",
      target: "实现营业收入135.84亿元，同比下滑7.14%",
      label: "下跌",
      description:
        "持续优化成本产生的下跌影响，导致了实现营业收入135.84亿元，同比下滑7.14%",
    },
    {
      source: "持续优化成本",
      target: "实现毛利率34.94%，同比上升9.59pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了实现毛利率34.94%，同比上升9.59pct",
    },
    {
      source: "国际家庭终端、国际手机产品营业收入减少",
      target: "实现毛利率22.26%，同比上升4.50pct",
      label: "上涨",
      description:
        "国际家庭终端、国际手机产品营业收入减少产生的上涨影响，导致了实现毛利率22.26%，同比上升4.50pct",
    },
    {
      source: "5G无线、核心网、固网产品收入增长",
      target: "政务业务营收",
      label: "无状态",
      description:
        "5G无线、核心网、固网产品收入增长产生的无状态影响，导致了政务业务营收",
    },
    {
      source: "5G无线、核心网、固网产品收入增长",
      target: "政务业务营收",
      label: "无状态",
      description:
        "5G无线、核心网、固网产品收入增长产生的无状态影响，导致了政务业务营收",
    },
    {
      source: "5G份额保持领先",
      target: "连接+算力打开长期成长空间",
      label: "上涨",
      description:
        "5G份额保持领先产生的上涨影响，导致了连接+算力打开长期成长空间",
    },
    {
      source: "5G无线、核心网、固网产品收入增长",
      target: "公司运营商网络业务营收",
      label: "无状态",
      description:
        "5G无线、核心网、固网产品收入增长产生的无状态影响，导致了公司运营商网络业务营收",
    },
    {
      source: "5G份额保持领先",
      target: "连接+算力打开长期成长空间",
      label: "上涨",
      description:
        "5G份额保持领先产生的上涨影响，导致了连接+算力打开长期成长空间",
    },
    {
      source: "持续优化成本",
      target: "营业收入827.59亿元，同比增长3.40%",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了营业收入827.59亿元，同比增长3.40%",
    },
    {
      source: "收入结构变动",
      target: "营业收入827.59亿元，同比增长3.40%",
      label: "上涨",
      description:
        "收入结构变动产生的上涨影响，导致了营业收入827.59亿元，同比增长3.40%",
    },
    {
      source: "持续优化成本",
      target: "实现毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了实现毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "实现营业收入135.84亿元，同比下滑7.14%",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的下跌影响，导致了实现营业收入135.84亿元，同比下滑7.14%",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "实现毛利率34.94%，同比上升9.59pct",
      label: "上涨",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的上涨影响，导致了实现毛利率34.94%，同比上升9.59pct",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "实现营业收入279.09亿元，同比略微减少1.33%",
      label: "下跌",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的下跌影响，导致了实现营业收入279.09亿元，同比略微减少1.33%",
    },
    {
      source: "Wi-Fi产品连续4年保持发货量第一",
      target: "家庭终端收入持续增长",
      label: "上涨",
      description:
        "Wi-Fi产品连续4年保持发货量第一产生的上涨影响，导致了家庭终端收入持续增长",
    },
    {
      source: "中兴通讯精准务实，稳健经营",
      target: "整体业绩符合预期",
      label: "其他状态类",
      description:
        "中兴通讯精准务实，稳健经营产生的其他状态类影响，导致了整体业绩符合预期",
    },
    {
      source: "季节性利润波动",
      target: "公司业绩短期承压",
      label: "下跌",
      description: "季节性利润波动产生的下跌影响，导致了公司业绩短期承压",
    },
    {
      source: "公司资产减值",
      target: "公司业绩短期承压",
      label: "下跌",
      description: "公司资产减值产生的下跌影响，导致了公司业绩短期承压",
    },
    {
      source: "运营商网络、政企和消费者业务三大业务的毛利率均有提升",
      target: "毛利率的提升",
      label: "上涨",
      description:
        "运营商网络、政企和消费者业务三大业务的毛利率均有提升产生的上涨影响，导致了毛利率的提升",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "毛利率为34.94%，同比提升9.59pct",
      label: "上涨",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的上涨影响，导致了毛利率为34.94%，同比提升9.59pct",
    },
    {
      source: "持续优化成本",
      target: "全年营业收入135.84亿元，同比减少7.14%",
      label: "下跌",
      description:
        "持续优化成本产生的下跌影响，导致了全年营业收入135.84亿元，同比减少7.14%",
    },
    {
      source: "国际家庭终端、国际手机产品营业收入减少",
      target: "全年营业收入 279.09亿元，同比减少 1.33%",
      label: "下跌",
      description:
        "国际家庭终端、国际手机产品营业收入减少产生的下跌影响，导致了全年营业收入 279.09亿元，同比减少 1.33%",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "实现毛利率22.26%，同比上升4.50pct",
      label: "上涨",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的上涨影响，导致了实现毛利率22.26%，同比上升4.50pct",
    },
    {
      source: "持续优化成本",
      target: "毛利率为34.94%，同比提升9.59pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了毛利率为34.94%，同比提升9.59pct",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "全年营业收入135.84亿元，同比减少7.14%",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的下跌影响，导致了全年营业收入135.84亿元，同比减少7.14%",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "全年营业收入 279.09亿元，同比减少 1.33%",
      label: "下跌",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的下跌影响，导致了全年营业收入 279.09亿元，同比减少 1.33%",
    },
    {
      source: "利润持续快速增长",
      target: "连接+算力打开长期成长空间",
      label: "上涨",
      description:
        "利润持续快速增长产生的上涨影响，导致了连接+算力打开长期成长空间",
    },
    {
      source: "汇率变动",
      target: "现金净增加额",
      label: "上涨",
      description: "汇率变动产生的上涨影响，导致了现金净增加额",
    },
    {
      source: "汇率变动",
      target: "现金净增加额",
      label: "上涨",
      description: "汇率变动产生的上涨影响，导致了现金净增加额",
    },
    {
      source: "利润持续快速增长",
      target: "连接+算力打开长期成长空间",
      label: "上涨",
      description:
        "利润持续快速增长产生的上涨影响，导致了连接+算力打开长期成长空间",
    },
    {
      source: "持续优化成本",
      target: "营业收入827.59亿元，同比增长3.40%",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了营业收入827.59亿元，同比增长3.40%",
    },
    {
      source: "收入结构变动",
      target: "实现毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "收入结构变动产生的上涨影响，导致了实现毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "实现营业收入135.84亿元，同比下滑7.14%",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的下跌影响，导致了实现营业收入135.84亿元，同比下滑7.14%",
    },
    {
      source: "持续优化成本",
      target: "实现毛利率34.94%，同比上升9.59pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了实现毛利率34.94%，同比上升9.59pct",
    },
    {
      source: "国际家庭终端、国际手机产品营业收入减少",
      target: "实现营业收入279.09亿元，同比略微减少1.33%",
      label: "下跌",
      description:
        "国际家庭终端、国际手机产品营业收入减少产生的下跌影响，导致了实现营业收入279.09亿元，同比略微减少1.33%",
    },
    {
      source: "无线产品、有线产品营业收入增长",
      target: "营业收入827.59亿元，同比增长3.40%",
      label: "上涨",
      description:
        "无线产品、有线产品营业收入增长产生的上涨影响，导致了营业收入827.59亿元，同比增长3.40%",
    },
    {
      source: "持续优化成本",
      target: "实现毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了实现毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "持续优化成本",
      target: "实现营业收入135.84亿元，同比下滑7.14%",
      label: "下跌",
      description:
        "持续优化成本产生的下跌影响，导致了实现营业收入135.84亿元，同比下滑7.14%",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "实现营业收入279.09亿元，同比略微减少1.33%",
      label: "下跌",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的下跌影响，导致了实现营业收入279.09亿元，同比略微减少1.33%",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "实现毛利率22.26%，同比上升4.50pct",
      label: "上涨",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的上涨影响，导致了实现毛利率22.26%，同比上升4.50pct",
    },
    {
      source: "国际市场家庭终端和手机产品市场需求下降",
      target: "政务业务营收",
      label: "无状态",
      description:
        "国际市场家庭终端和手机产品市场需求下降产生的无状态影响，导致了政务业务营收",
    },
    {
      source: "新兴产品持续导入市场",
      target: "市场份额及盈利能力有望进一步提升",
      label: "上涨",
      description:
        "新兴产品持续导入市场产生的上涨影响，导致了市场份额及盈利能力有望进一步提升",
    },
    {
      source:
        "公司工业、冶金钢铁、矿山、汽车电子业务均已实现与多家行业头部企业的合作",
      target: "助力行业数智化转型",
      label: "其他状态类",
      description:
        "公司工业、冶金钢铁、矿山、汽车电子业务均已实现与多家行业头部企业的合作产生的其他状态类影响，导致了助力行业数智化转型",
    },
    {
      source: "收入结构变动",
      target: "营业收入827.59亿元，同比增长3.40%",
      label: "上涨",
      description:
        "收入结构变动产生的上涨影响，导致了营业收入827.59亿元，同比增长3.40%",
    },
    {
      source: "无线产品、有线产品营业收入增长",
      target: "实现毛利率49.11%，同比提升2.89pct",
      label: "上涨",
      description:
        "无线产品、有线产品营业收入增长产生的上涨影响，导致了实现毛利率49.11%，同比提升2.89pct",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "实现毛利率34.94%，同比上升9.59pct",
      label: "上涨",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的上涨影响，导致了实现毛利率34.94%，同比上升9.59pct",
    },
    {
      source: "国际家庭终端、国际手机产品营业收入减少",
      target: "实现毛利率22.26%，同比上升4.50pct",
      label: "上涨",
      description:
        "国际家庭终端、国际手机产品营业收入减少产生的上涨影响，导致了实现毛利率22.26%，同比上升4.50pct",
    },
    {
      source: "Wi-Fi产品连续4年保持发货量第一",
      target: "家庭终端收入持续增长",
      label: "上涨",
      description:
        "Wi-Fi产品连续4年保持发货量第一产生的上涨影响，导致了家庭终端收入持续增长",
    },
    {
      source: "5G无线、核心网、固网产品收入增长",
      target: "公司运营商网络业务营收",
      label: "无状态",
      description:
        "5G无线、核心网、固网产品收入增长产生的无状态影响，导致了公司运营商网络业务营收",
    },
    {
      source:
        "公司工业、冶金钢铁、矿山、汽车电子业务均已实现与多家行业头部企业的合作",
      target: "助力行业数智化转型",
      label: "其他状态类",
      description:
        "公司工业、冶金钢铁、矿山、汽车电子业务均已实现与多家行业头部企业的合作产生的其他状态类影响，导致了助力行业数智化转型",
    },
    {
      source: "国际市场家庭终端和手机产品市场需求下降",
      target: "政务业务营收",
      label: "无状态",
      description:
        "国际市场家庭终端和手机产品市场需求下降产生的无状态影响，导致了政务业务营收",
    },
    {
      source: "公司运营商业务在行业竞争格局向好",
      target: "市场份额及盈利能力有望进一步提升",
      label: "上涨",
      description:
        "公司运营商业务在行业竞争格局向好产生的上涨影响，导致了市场份额及盈利能力有望进一步提升",
    },
    {
      source: "季节性利润波动",
      target: "公司业绩短期承压",
      label: "下跌",
      description: "季节性利润波动产生的下跌影响，导致了公司业绩短期承压",
    },
    {
      source: "新兴产品持续导入市场",
      target: "市场份额及盈利能力有望进一步提升",
      label: "上涨",
      description:
        "新兴产品持续导入市场产生的上涨影响，导致了市场份额及盈利能力有望进一步提升",
    },
    {
      source: "中兴通讯精准务实，稳健经营",
      target: "整体业绩符合预期",
      label: "其他状态类",
      description:
        "中兴通讯精准务实，稳健经营产生的其他状态类影响，导致了整体业绩符合预期",
    },
    {
      source: "运营商网络、政企和消费者业务三大业务的毛利率均有提升",
      target: "毛利率的提升",
      label: "上涨",
      description:
        "运营商网络、政企和消费者业务三大业务的毛利率均有提升产生的上涨影响，导致了毛利率的提升",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "全年营业收入135.84亿元，同比减少7.14%",
      label: "下跌",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的下跌影响，导致了全年营业收入135.84亿元，同比减少7.14%",
    },
    {
      source: "国际家庭终端、国际手机产品营业收入减少",
      target: "全年营业收入 279.09亿元，同比减少 1.33%",
      label: "下跌",
      description:
        "国际家庭终端、国际手机产品营业收入减少产生的下跌影响，导致了全年营业收入 279.09亿元，同比减少 1.33%",
    },
    {
      source: "公司资产减值",
      target: "公司业绩短期承压",
      label: "下跌",
      description: "公司资产减值产生的下跌影响，导致了公司业绩短期承压",
    },
    {
      source: "政企和消费者业务成本减少",
      target: "毛利率的提升",
      label: "上涨",
      description: "政企和消费者业务成本减少产生的上涨影响，导致了毛利率的提升",
    },
    {
      source: "持续优化成本",
      target: "毛利率为34.94%，同比提升9.59pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了毛利率为34.94%，同比提升9.59pct",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "全年营业收入 279.09亿元，同比减少 1.33%",
      label: "下跌",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的下跌影响，导致了全年营业收入 279.09亿元，同比减少 1.33%",
    },
    {
      source: "国内集成类项目、数据中心和国际市场营业收入减少",
      target: "毛利率为34.94%，同比提升9.59pct",
      label: "上涨",
      description:
        "国内集成类项目、数据中心和国际市场营业收入减少产生的上涨影响，导致了毛利率为34.94%，同比提升9.59pct",
    },
    {
      source: "持续优化成本",
      target: "全年营业收入135.84亿元，同比减少7.14%",
      label: "下跌",
      description:
        "持续优化成本产生的下跌影响，导致了全年营业收入135.84亿元，同比减少7.14%",
    },
    {
      source: "公司运营商业务在行业竞争格局向好",
      target: "市场份额及盈利能力有望进一步提升",
      label: "上涨",
      description:
        "公司运营商业务在行业竞争格局向好产生的上涨影响，导致了市场份额及盈利能力有望进一步提升",
    },
    {
      source: "国际家庭终端、国际手机产品营业收入减少",
      target: "实现营业收入279.09亿元，同比略微减少1.33%",
      label: "下跌",
      description:
        "国际家庭终端、国际手机产品营业收入减少产生的下跌影响，导致了实现营业收入279.09亿元，同比略微减少1.33%",
    },
    {
      source: "政企和消费者业务成本减少",
      target: "毛利率的提升",
      label: "上涨",
      description: "政企和消费者业务成本减少产生的上涨影响，导致了毛利率的提升",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "政企业务毛利率为34.94%，同比增长9.59pct",
      label: "上涨",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的上涨影响，导致了政企业务毛利率为34.94%，同比增长9.59pct",
    },
    {
      source: "持续优化成本",
      target: "消费者业务毛利率为22.26%，同比增长4.50pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了消费者业务毛利率为22.26%，同比增长4.50pct",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "消费者业务毛利率为22.26%，同比增长4.50pct",
      label: "上涨",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的上涨影响，导致了消费者业务毛利率为22.26%，同比增长4.50pct",
    },
    {
      source: "收入结构变动",
      target: "运营商网络毛利率为49.11%，同比增长2.89pct",
      label: "上涨",
      description:
        "收入结构变动产生的上涨影响，导致了运营商网络毛利率为49.11%，同比增长2.89pct",
    },
    {
      source: "持续优化成本",
      target: "政企业务毛利率为34.94%，同比增长9.59pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了政企业务毛利率为34.94%，同比增长9.59pct",
    },
    {
      source: "持续优化成本",
      target: "运营商网络毛利率为49.11%，同比增长2.89pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了运营商网络毛利率为49.11%，同比增长2.89pct",
    },
    {
      source: "持续优化成本",
      target: "运营商网络毛利率为49.11%，同比增长2.89pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了运营商网络毛利率为49.11%，同比增长2.89pct",
    },
    {
      source: "收入短期承压",
      target: "净利润维持增长态势",
      label: "上涨",
      description: "收入短期承压产生的上涨影响，导致了净利润维持增长态势",
    },
    {
      source: "运营商网络、政企和消费者业务三大业务的毛利率均有提升",
      target: "公司销售毛利率为41.53%，同比上升4.34个百分点",
      label: "上涨",
      description:
        "运营商网络、政企和消费者业务三大业务的毛利率均有提升产生的上涨影响，导致了公司销售毛利率为41.53%，同比上升4.34个百分点",
    },
    {
      source: "汇率波动",
      target: "产生汇兑收益",
      label: "其他状态类",
      description: "汇率波动产生的其他状态类影响，导致了产生汇兑收益",
    },
    {
      source: "市场推广投入增加",
      target: "销售费用",
      label: "无状态",
      description: "市场推广投入增加产生的无状态影响，导致了销售费用",
    },
    {
      source: "本期购买商品、接受劳务支付的现金减少",
      target: "经营活动产生的现金流净额为174.06亿元，同比上升129.7%",
      label: "上涨",
      description:
        "本期购买商品、接受劳务支付的现金减少产生的上涨影响，导致了经营活动产生的现金流净额为174.06亿元，同比上升129.7%",
    },
    {
      source: "运营商网络、政企和消费者业务三大业务的毛利率均有提升",
      target: "公司销售毛利率为41.53%，同比上升4.34个百分点",
      label: "上涨",
      description:
        "运营商网络、政企和消费者业务三大业务的毛利率均有提升产生的上涨影响，导致了公司销售毛利率为41.53%，同比上升4.34个百分点",
    },
    {
      source: "市场推广投入增加",
      target: "销售费用",
      label: "无状态",
      description: "市场推广投入增加产生的无状态影响，导致了销售费用",
    },
    {
      source: "收入短期承压",
      target: "净利润维持增长态势",
      label: "上涨",
      description: "收入短期承压产生的上涨影响，导致了净利润维持增长态势",
    },
    {
      source: "汇率波动",
      target: "产生汇兑收益",
      label: "其他状态类",
      description: "汇率波动产生的其他状态类影响，导致了产生汇兑收益",
    },
    {
      source: "本期购买商品、接受劳务支付的现金减少",
      target: "经营活动产生的现金流净额为174.06亿元，同比上升129.7%",
      label: "上涨",
      description:
        "本期购买商品、接受劳务支付的现金减少产生的上涨影响，导致了经营活动产生的现金流净额为174.06亿元，同比上升129.7%",
    },
    {
      source: "持续优化成本",
      target: "政企业务毛利率为34.94%，同比增长9.59pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了政企业务毛利率为34.94%，同比增长9.59pct",
    },
    {
      source: "持续优化成本",
      target: "消费者业务毛利率为22.26%，同比增长4.50pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了消费者业务毛利率为22.26%，同比增长4.50pct",
    },
    {
      source: "收入结构变动",
      target: "运营商网络毛利率为49.11%，同比增长2.89pct",
      label: "上涨",
      description:
        "收入结构变动产生的上涨影响，导致了运营商网络毛利率为49.11%，同比增长2.89pct",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "政企业务毛利率为34.94%，同比增长9.59pct",
      label: "上涨",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的上涨影响，导致了政企业务毛利率为34.94%，同比增长9.59pct",
    },
    {
      source: "持续优化成本",
      target: "运营商网络毛利率为49.11%，同比增长2.89pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了运营商网络毛利率为49.11%，同比增长2.89pct",
    },
    {
      source: "持续优化成本",
      target: "运营商网络毛利率为49.11%，同比增长2.89pct",
      label: "上涨",
      description:
        "持续优化成本产生的上涨影响，导致了运营商网络毛利率为49.11%，同比增长2.89pct",
    },
    {
      source: "国际家庭信息终端、手机产品毛利率提升",
      target: "消费者业务毛利率为22.26%，同比增长4.50pct",
      label: "上涨",
      description:
        "国际家庭信息终端、手机产品毛利率提升产生的上涨影响，导致了消费者业务毛利率为22.26%，同比增长4.50pct",
    },
  ],
};
